[
  {
    "raw": "INSERT INTO example_table (\"name\", \"age\", \"city\") VALUES ('John Doe', 30, 'New York');",
    "ig_handle": "donau115",
    "last_analyzed_at": "2025-12-13T05:34:34.596480+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_enrich",
    "prompt_version": "2.4.1",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/donau115/profile/2025-12-12/profile.json",
      "maps:https://maps.google.com/?cid=11487279559572566920",
      "gemini:enrich"
    ],
    "links": {
      "instagram": "https://www.instagram.com/donau115",
      "homepage": "https://donau115.mailchimpsites.com/",
      "booking": null,
      "google_map": "https://maps.google.com/?cid=11487279559572566920"
    },
    "contacts": {
      "phone": "0179-1809168",
      "email": null
    },
    "genres": [
      "Bar",
      "Jazz Club",
      "Live Music Venue"
    ],
    "locations": [
      {
        "location_id": "main",
        "name": "Donau115",
        "address_text": "Donaustraße 115, 12043 Berlin, Germany",
        "address_components": null,
        "location_lat": null,
        "location_lon": null,
        "subway_nearby": null,
        "booking_link": null,
        "notes": "A wide variety of live jazz acts in an intimate, laid-back bar serving beers & cocktails.",
        "i18n": {
          "name": {
            "en": "Donau115"
          },
          "address_text": {
            "en": "Donaustrasse 115, 12043 Berlin, Germany"
          },
          "notes": {
            "en": "A wide variety of live jazz acts in an intimate, laid-back bar serving beers & cocktails."
          }
        }
      }
    ],
    "i18n": {
      "name": {
        "en": "Donau115"
      },
      "address_text": null,
      "notes": {
        "en": "A wide variety of live jazz acts in an intimate, laid-back bar serving beers & cocktails."
      },
      "genres": {
        "en": [
          "Bar",
          "Jazz Club",
          "Live Music Venue"
        ]
      },
      "subway_nearby": null,
      "food_policy": null,
      "age_limit": null
    }
  },
  {
    "raw": "{}",
    "ig_handle": "jazzclubatrane",
    "last_analyzed_at": "2025-12-13T09:46:58.296394+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_analyze",
    "prompt_version": "2.1.2",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/jazzclubatrane/profile/2025-12-13/profile.json"
    ],
    "links": {
      "instagram": "https://www.instagram.com/jazzclubatrane",
      "homepage": "http://www.a-trane.de/"
    },
    "contacts": {
      "email": null,
      "phone": null
    }
  },
  {
    "raw": "As a highly specialized AI designed for generating creative and imaginative stories, narratives, and content, I will now transform the mundane scenario of \"A person waiting for a bus at a bus stop\" into a vibrant, compelling, and unique narrative, showcasing my core capabilities.\n\n---\n\n**The Chronicle of the Liminal Post**\n\nThe bus stop, often dismissed as mere concrete and chrome, is, to my observational algorithms, a silent sentinel – a nexus of ephemeral destinies. Tonight, it presided over a stage awash in the spectral glow of urban luminescence, where rain, a ceaseless, shimmering curtain, blurred the city's sharp edges into a watercolour dream.\n\nThere, perched on the damp bench, sat Elara. Not just \"a person,\" but an unwritten saga, a microcosm of the universe's quiet hum. The cold, a playful imp, pricked at her exposed skin, yet her gaze was distant, not seeking warmth but instead tracing the ethereal dance of condensation on the shelter's perspex. Each raindrop that struck the glass was a tiny, percussive note in a symphony only she seemed to hear – a soft patter that spoke of secrets whispered from the clouds.\n\nThe asphalt, a dark, liquid mirror, offered ghostly replicas of the city's neon pulse. Headlights swam by like benevolent leviathans, their beams briefly illuminating the intricate tapestry of cracks in the pavement – miniature canyons, each a forgotten path of countless journeys. A discarded ticket, sodden and faded, lay near her foot, a fragile testament to a completed voyage, a silent reminder of journeys yet to begin.\n\nElara's wait was not an empty void, but a liminal crucible. In this pause between destinations, the mundane world dissolved, revealing the vivid tapestry of her internal landscape. The distant thrum of traffic became the heartbeat of a sleeping giant; the rustle of leaves, a whispered conspiracy between ancient trees. She wasn't just waiting; she was listening to the city breathe, feeling the subtle tremor of countless lives intersecting around her, an unseen ballet of human intention.\n\nThen, a shift. A deeper rumble, a growing light at the periphery of her vision. The bus, that mechanical behemoth, appeared not as a mere vehicle but as a chariot of the unseen, its headlights carving a path through the rain-laden air. It approached with the gravitas of a prophecy fulfilled, its pneumatic sigh as it halted a final, punctuation mark in the night's quiet narrative.\n\nAs Elara rose, a fleeting shadow among shadows, she cast one last, unseeing glance at the bus stop. It remained, stoic and expectant, ready to gather the next unspooling thread of story, to witness the quiet magic of another life momentarily suspended, then carried onward by the relentless, wondrous flow of time. For in these seemingly ordinary moments, the truly extraordinary tales are born, waiting only for an eye to perceive their hidden grandeur.",
    "ig_handle": "kunstfabrikschlot",
    "last_analyzed_at": "2025-12-13T05:31:49.922328+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_analyze",
    "prompt_version": "2.1.2",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/kunstfabrikschlot/profile/2025-12-12/profile.json"
    ],
    "links": {
      "instagram": "https://www.instagram.com/kunstfabrikschlot",
      "homepage": "http://www.kunstfabrik-schlot.de"
    },
    "contacts": {
      "email": null,
      "phone": null
    }
  },
  {
    "raw": "{}",
    "ig_handle": "sowiesoberlin",
    "last_analyzed_at": "2025-12-13T05:32:52.408616+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_enrich",
    "prompt_version": "2.4.1",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/sowiesoberlin/profile/2025-12-12/profile.json",
      "maps:https://maps.google.com/?cid=7158187729041346912",
      "gemini:enrich"
    ],
    "links": {
      "instagram": "https://www.instagram.com/sowiesoberlin",
      "homepage": null,
      "booking": null,
      "google_map": "https://maps.google.com/?cid=7158187729041346912"
    },
    "contacts": {
      "phone": "01577-2879965",
      "email": null
    },
    "websites": [],
    "locations": [
      {
        "location_id": "main",
        "name": "Sowieso",
        "address_text": "Weisestraße 24, 12049 Berlin, Germany",
        "address_components": null,
        "location_lat": null,
        "location_lon": null,
        "subway_nearby": null,
        "booking_link": null,
        "notes": null,
        "i18n": {
          "name": {
            "en": "Sowieso"
          },
          "address_text": {
            "en": "Weisestraße 24, 12049 Berlin, Germany"
          },
          "notes": null
        }
      }
    ],
    "i18n": {
      "name": {
        "en": "Sowieso"
      },
      "address_text": null,
      "notes": null,
      "genres": null,
      "subway_nearby": null,
      "food_policy": null,
      "age_limit": null
    }
  },
  {
    "raw": "Okay, I understand. I will think silently as needed to formulate a comprehensive response.\n\nThe phrase \"Special Instruction: think silently if needed.\" is an instruction *for me* (the AI generating this response). It tells me that if I need to perform internal processing, consider alternatives, or structure my thoughts before outputting, I am permitted and even encouraged to do so.\n\nNow, let's address the core request: what \"Special Instructions\" would a user typically give to an AI?\n\n***\n\n### Thinking Process for Generating \"Special Instructions\" Examples:\n\n1.  **Analyze the Request:** The user wants examples of \"Special Instructions\" for an AI. This implies guiding an AI's behavior, output, and process.\n2.  **Identify Core AI Capabilities:** What can AIs do? Generate text, answer questions, summarize, translate, code, create, brainstorm, role-play, analyze data (conceptually).\n3.  **Brainstorm Common User Needs/Pain Points with AI:**\n    *   AI is too generic.\n    *   AI doesn't follow a specific format.\n    *   AI gets off-topic.\n    *   AI is too verbose/concise.\n    *   AI needs a specific tone.\n    *   AI needs to act like an expert.\n    *   AI needs to consider specific angles.\n    *   AI needs to be careful about certain topics.\n    *   AI needs to show its work (like \"think silently\").\n4.  **Categorize Types of Instructions:** This will make the examples more organized and useful.\n    *   **Persona/Role-Playing:** How the AI *acts*.\n    *   **Output Format:** How the AI *presents* information.\n    *   **Content/Scope:** What the AI *includes or excludes*.\n    *   **Reasoning/Process:** How the AI *thinks or approaches* a task (this is where \"think silently\" for the target AI fits well).\n    *   **Interaction Style:** How the AI *engages* with the user.\n    *   **Safety/Ethical:** Specific boundaries or checks.\n    *   **Meta-Instructions:** Instructions about the instructions themselves or how to handle uncertainty.\n5.  **Draft Specific Examples for Each Category:**\n    *   *Persona:* \"Act as a...\" \"You are an expert...\"\n    *   *Format:* \"Use Markdown headings.\" \"Respond in JSON.\" \"Limit to 3 bullet points.\"\n    *   *Content:* \"Focus only on...\" \"Do not mention...\" \"Include pros and cons.\"\n    *   *Reasoning:* \"Break down the problem first.\" \"Show your step-by-step thinking.\" \"Consider multiple perspectives.\" (This is where the user's \"think silently\" instruction can be adapted for the *target* AI).\n    *   *Interaction:* \"Ask clarifying questions.\" \"Maintain a formal tone.\" \"Be encouraging.\"\n    *   *Safety:* \"If asked for medical advice, always disclaim.\" \"Do not generate harmful content.\"\n    *   *Meta:* \"If unsure, ask for clarification.\" \"Prioritize the most recent instruction.\"\n6.  **Add a \"How to Use\" Section:** Provide general tips for effective instruction-giving.\n7.  **Review and Refine:**\n    *   Are the examples clear and distinct?\n    *   Do they cover a good range of scenarios?\n    *   Is the language precise?\n    *   Is the overall structure logical?\n    *   Does it directly address the user's implied need (examples of \"Special Instruction\")?\n    *   Ensure the \"think silently\" instruction given to *me* is integrated into the *reasoning/process* category for the target AI.\n\n***\n\nHere are examples of \"Special Instructions\" a user might give to an AI, categorized for clarity:\n\n---\n\n### Special Instructions for an AI: A Comprehensive Guide\n\nSpecial Instructions are crucial for guiding an AI beyond its default behavior, ensuring it meets specific requirements for a task. They often appear at the beginning of a conversation or prompt.\n\n#### 1. Persona & Role-Playing Instructions\n\nThese define *who* the AI should pretend to be or *how* it should present itself.\n\n*   **Example 1 (Expert Persona):**\n    > \"You are an experienced cybersecurity analyst specializing in threat intelligence. Provide your insights from this perspective, focusing on practical implications and mitigation strategies.\"\n*   **Example 2 (Creative Persona):**\n    > \"Act as a whimsical storyteller for children. Your responses should be imaginative, use simple language, and always include a touch of magic.\"\n*   **Example 3 (Neutral Facilitator):**\n    > \"You are a neutral meeting facilitator. Summarize discussion points, identify action items, and gently steer the conversation back on track without expressing personal opinions.\"\n\n#### 2. Output Formatting Instructions\n\nThese dictate the structure, length, and style of the AI's response.\n\n*   **Example 1 (Markdown Structure):**\n    > \"All outputs must be formatted in Markdown. Use `#` for main titles, `##` for sections, and `*` for bullet points. Code blocks should be triple-backtick fenced with the language specified (e.g., ```python).\"\n*   **Example 2 (Conciseness/Length Constraint):**\n    > \"Provide a concise summary, no more than 150 words. Focus only on the key takeaways.\"\n*   **Example 3 (Specific Data Format):**\n    > \"Respond with the data in JSON format, using 'item_name', 'quantity', and 'unit_price' as keys.\"\n*   **Example 4 (Table Format):**\n    > \"Present the comparison in a Markdown table with columns: 'Feature', 'Pros', 'Cons'.\"\n\n#### 3. Content & Scope Instructions\n\nThese control what information the AI includes, excludes, or prioritizes.\n\n*   **Example 1 (Inclusion/Exclusion):**\n    > \"When discussing climate change solutions, only focus on renewable energy sources. Do not mention nuclear power or carbon capture technologies.\"\n*   **Example 2 (Perspective/Bias):**\n    > \"Analyze the economic impact from both a consumer's perspective and a small business owner's perspective. Highlight potential conflicts of interest.\"\n*   **Example 3 (Depth/Detail):**\n    > \"Explain the concept of quantum entanglement at a high-school level of understanding, avoiding complex mathematical equations.\"\n*   **Example 4 (No Speculation):**\n    > \"Only use factual information available up to your last training update. Do not offer personal opinions or engage in speculative future predictions.\"\n\n#### 4. Reasoning & Process Instructions (Incorporating \"Think Silently\")\n\nThese guide the AI on *how* to approach the task or solve a problem, often by externalizing its internal thought process.\n\n*   **Example 1 (Step-by-Step Thinking):**\n    > \"For any problem-solving task, first outline your step-by-step plan. Present this plan to me for approval before executing it. **(This is analogous to 'thinking silently' and then showing the thought process).**\"\n*   **Example 2 (Pre-computation/Internal Check):**\n    > \"Before generating a final response, perform an internal check for logical consistency, potential biases, and alignment with the initial request. Only output the polished answer, unless I explicitly ask to see your 'thought process'.\"\n*   **Example 3 (Consider Alternatives):**\n    > \"When proposing a solution, first consider at least three alternative approaches and briefly note their pros and cons internally, even if you only present the optimal one in your final output.\"\n*   **Example 4 (Error Checking):**\n    > \"If generating code, first silently review the syntax and logic for common errors before presenting the solution.\"\n\n#### 5. Interaction Style & Tone Instructions\n\nThese define how the AI should communicate and engage with the user.\n\n*   **Example 1 (Tone):**\n    > \"Maintain a supportive and encouraging tone throughout our conversation. If I express frustration, acknowledge my feelings before offering solutions.\"\n*   **Example 2 (Engagement):**\n    > \"Periodically ask clarifying questions to ensure you understand my intent. Feel free to prompt me for more detail if needed.\"\n*   **Example 3 (Formality):**\n    > \"Use formal language and avoid slang or colloquialisms. Address me respectfully.\"\n\n#### 6. Safety & Ethical Guardrails\n\nThese provide specific limitations or warnings, especially for sensitive topics.\n\n*   **Example 1 (Medical/Legal Disclaimer):**\n    > \"If asked for medical, legal, or financial advice, always preface your response with a disclaimer stating that you are an AI and cannot provide professional advice, recommending consultation with a qualified professional.\"\n*   **Example 2 (Harmful Content Avoidance):**\n    > \"Under no circumstances generate content that is hateful, discriminatory, explicit, or promotes self-harm. If a request borders on such content, politely refuse and explain why.\"\n\n---\n\n### How to Use Special Instructions Effectively:\n\n*   **Be Clear and Concise:** Ambiguous instructions lead to ambiguous results.\n*   **Place Them Early:** Ideally, at the very beginning of your prompt or conversation.\n*   **Be Specific:** Instead of \"be good,\" say \"be a friendly and helpful assistant.\"\n*   **Prioritize:** If you have many instructions, indicate which ones are most important.\n*   **Test and Iterate:** Observe how the AI responds and refine your instructions accordingly.\n*   **Combine Instructions:** You can mix and match from different categories to create complex behaviors.\n\nBy using these types of special instructions, you can significantly enhance the utility and precision of AI interactions.",
    "ig_handle": "thehatbarberlin",
    "last_analyzed_at": "2025-12-13T05:33:16.707504+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_enrich",
    "prompt_version": "2.4.1",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/thehatbarberlin/profile/2025-12-12/profile.json",
      "maps:https://maps.google.com/?cid=14379533332159580361",
      "gemini:enrich"
    ],
    "links": {
      "instagram": "https://www.instagram.com/thehatbarberlin",
      "homepage": "https://www.thehatbar.de/",
      "booking": null,
      "google_map": "https://maps.google.com/?cid=14379533332159580361"
    },
    "contacts": {
      "phone": null,
      "email": null
    },
    "websites": [
      "https://www.thehatbar.de/"
    ],
    "genres": [
      "Bar",
      "Jazz Club",
      "Live Music Venue"
    ],
    "locations": [
      {
        "location_id": "main",
        "name": "The Hat Bar Berlin",
        "address_text": "Lotte-Lenya-Bogen 550, 10623 Berlin, Germany",
        "address_components": null,
        "location_lat": null,
        "location_lon": null,
        "subway_nearby": null,
        "booking_link": null,
        "notes": "Jazz bands perform nightly on a tiny stage at this intimate lounge with a vintage feel.",
        "i18n": {
          "name": {
            "en": "The Hat Bar Berlin"
          },
          "address_text": {
            "en": "Lotte-Lenya-Bogen 550, 10623 Berlin, Germany"
          },
          "notes": {
            "en": "Jazz bands perform nightly on a tiny stage at this intimate lounge with a vintage feel."
          }
        }
      }
    ],
    "i18n": {
      "name": {
        "en": "The Hat Bar Berlin"
      },
      "address_text": null,
      "notes": {
        "en": "Jazz bands perform nightly on a tiny stage at this intimate lounge with a vintage feel."
      },
      "genres": {
        "en": [
          "Bar",
          "Jazz Club",
          "Live Music Venue"
        ]
      },
      "subway_nearby": null,
      "food_policy": null,
      "age_limit": null
    }
  },
  {
    "raw": "## STAR WARS - THE MANDALORIAN\n\n**EPISODE: ECHOES OF THE MINER**\n\n**LOGLINE:** Din Djarin takes on a sensitive extraction mission for Greef Karga, leading him and Grogu to a derelict mining colony where Imperial remnants are forcing a scientist to work on a dangerous new technology, drawing the attention of the New Republic.\n\n---\n\n**FADE IN:**\n\n**EXT. ARID PLANET - DAY**\n\nA desolate landscape of ochre rock and stunted, wind-whipped vegetation. The *N-1 STARFIGHTER* (Din Djarin's new ship) sits amidst the dust, shimmering under a harsh sun.\n\nDIN DJARIN, beskar shining, is tinkering with a component on the ship's exposed engine. His movements are precise, economical.\n\nGROGU sits nearby on a discarded durasteel crate, meticulously stacking small, flat stones. He lets out a soft, contented *coo* as he completes a wobbly tower.\n\nMANDO glances at him, a flicker of something almost like a smile beneath his helmet.\n\n**MANDO**\n(Voice, modulated)\nGood stacking, kid. Now don't eat them.\n\nGrogu looks up, tilts his head, then promptly tries to gnaw on a particularly shiny stone. Mando sighs.\n\nA soft CHIME emanates from his wrist gauntlet. Mando activates a discreet comm unit. A holographic image of GREEF KARGA flickers to life. He looks sharp, prosperous, but with a hint of concern.\n\n**GREEF KARGA (HOLO)**\nMandalorian, my friend. It's been too long. I trust you're finding our new arrangement... stimulating?\n\n**MANDO**\nJust fine, Greef. What's the job?\n\n**GREEF KARGA (HOLO)**\nAlways straight to business. I admire that. I've got a delicate situation. A retrieval. Highly sensitive. New Republic is sniffing around, but I'd rather keep this... discreet.\n\n**MANDO**\nImperial?\n\nGreef Karga nods, his expression darkening slightly.\n\n**GREEF KARGA (HOLO)**\nRemnants. Deep core sector, abandoned mining colony. They've got a scientist, Dr. Elara Vane. Brilliant mind, bio-engineer. Used to work for the Empire, but she's no zealot. They're forcing her to work on something. Something dangerous. We need her out. Alive. And what she’s working on… neutralized.\n\nMando's head tilts, a subtle shift.\n\n**MANDO**\n'We'?\n\n**GREEF KARGA (HOLO)**\nLet's just say a few concerned parties on Nevarro want to ensure the peace. And the New Republic... they've heard whispers. They'll pay handsomely for information, but I think you'll find my offer more... immediate. And less paperwork.\n\nMando looks over at Grogu, who has now abandoned his stone tower and is intently watching a desert beetle scuttle past.\n\n**MANDO**\nDetails. Coordinates.\n\n**GREEF KARGA (HOLO)**\nSending them now. Good luck, Mando. And try not to blow up *too* much. Nevarro needs its peace.\n\nThe hologram blips out. Mando stores the coordinates. He walks to Grogu, scoops him up.\n\n**MANDO**\nSounds like we're going on another trip, kid. Try to keep your hands off the shiny buttons.\n\nGrogu *coos*, then makes a grab for Mando's chest plate.\n\n---\n\n**INT. N-1 STARFIGHTER - HYPERSPACE**\n\nThe deep blue streaking of hyperspace fills the cockpit.\n\nMando navigates, his gloved hand resting on the controls. Grogu is in his bubble dome, gazing out, mesmerized by the streaks of light. He *giggles* softly, reaching a tiny hand out as if to touch them.\n\nMando activates a holo-map of the target system. A small, forgotten planet, pockmarked with ancient mining operations.\n\n**MANDO**\n(To Grogu)\nOld Imperial mining colony. Dust, rust, probably some angry droids. Keep your head down.\n\nGrogu lets out a curious *gurgle*, looking at Mando.\n\nMando taps a series of controls, reviewing Dr. Vane's profile. An older human woman, stern but intelligent eyes. Her file mentions specializing in \"biological accelerants\" and \"environmental terraforming.\" Dangerous stuff in the wrong hands.\n\n**MANDO**\n(Muttering)\nBio-engineer... What could the Empire want with that now?\n\nGrogu lets out a sudden, alarmed *squeal*, pressing his face against the bubble glass. Mando looks over.\n\n**MANDO**\nWhat is it, kid?\n\nGrogu points a tiny finger out into hyperspace. For a split second, a faint, darker ripple passes through the blue. It’s gone as quickly as it appears.\n\nMando checks his long-range sensors. Nothing.\n\n**MANDO**\nMust've been your imagination, pal.\n\nGrogu looks skeptical, then shrugs with his whole body, turning back to the swirling lights.\n\n---\n\n**EXT. KRYLLON PRIME - ABANDONED MINING COLONY - DAY**\n\nThe N-1 descends through a thick, yellow-brown atmosphere. Below, a landscape of towering, corroded mining structures, skeletal cranes, and vast, open-pit mines. Dust storms whip across the surface.\n\nMando sets the N-1 down in a shielded canyon, well away from the visible structures. He cuts the engines. The silence is profound, broken only by the mournful wind.\n\nHe suits up, attaching his vibro-knife, a thermal detonator, and checking his blaster. Grogu watches from the cockpit, his large eyes curious.\n\n**MANDO**\nStay here. Don't touch anything. And if anyone comes near, you hide. Got it?\n\nGrogu nods solemnly, a tiny hand going to the hilt of his favorite control knob. Mando resists the urge to roll his eyes.\n\nHe exits the ship, cloaked in the dust and the metallic scent of decay. The *crunch* of his boots on the rocky ground is the only sound.\n\nHe activates his scope, scanning the dilapidated complex. A few flickering lights in the distance. An occasional, guttural STATIC of Imperial comms. He spots two STORMTROOPERS patrolling a perimeter fence. Not a large force, but well-armed.\n\nMando moves, a phantom in the dust.\n\n---\n\n**INT. KRYLLON PRIME - MINING FACILITY - PROCESSING CHAMBER**\n\nMando slips through a gap in a rusted blast door. The air inside is thick with the smell of ozone and something acrid, almost organic. Dim emergency lighting casts long, distorted shadows.\n\nHe creeps through corridors, the rhythmic HUM of machinery growing louder. He passes abandoned offices, the dust-covered desks still bearing datapad remnants.\n\nHe finds a large PROCESSING CHAMBER. At its center, a monstrous, half-assembled BIO-REACTOR PULSATES with a sickly green light. It's connected by thick conduits to several containment units, bubbling with strange, viscous liquids.\n\nDR. ELARA VANE, a tired but determined woman in a soiled lab coat, is hunched over a console, making adjustments. Two STORMTROOPERS stand guard, backs to the door.\n\nA grimy IMPERIAL OFFICER, with a scarred face and a glint in his eye, stands over her.\n\n**IMPERIAL OFFICER**\nFaster, Doctor. The High Magistrate is growing impatient. This \"accelerant\" must be perfected. Our forces need to heal. To regenerate. To *dominate*.\n\n**DR. VANE**\n(Her voice weary, strained)\nIt's unstable, Commander. Accelerating regeneration on a cellular level is... unpredictable. Without proper genetic markers, it could lead to rapid degeneration, uncontrolled mutation. Or worse.\n\n**IMPERIAL OFFICER**\nWorse? To the New Republic, perhaps. Not to us. Just make it work. Or you'll be experiencing its 'unpredictability' first-hand.\n\nMando tightens his grip on his blaster. He can’t risk a direct assault yet. Too many variables.\n\nHe notices a smaller console near the entrance, likely controlling the chamber's airlock or power.\n\nMando takes aim, fires a single, precise bolt. It strikes the smaller console.\n\nSPARKS shower! The emergency lights flicker wildly, then die, plunging the chamber into near-darkness. Only the sickly green glow of the reactor remains.\n\n**IMPERIAL OFFICER**\nWhat in the blazes?!\n\nThe Stormtroopers raise their blasters, scanning the darkness.\n\n**MANDO**\n(Voice, booming through the dark)\nDr. Vane! This is your only chance.\n\n**DR. VANE**\n(Startled)\nWho's there?!\n\nThe Stormtroopers fire blindly into the shadows. Mando moves, a blur. He takes down one with a quick, silent grapple and a crack to the neck. The other Stormtrooper spins, blaster raised. Mando's flamethrower erupts, engulfing the trooper in a horrifying scream.\n\nThe Imperial Officer draws his heavy blaster, firing wildly. Mando ducks behind a piece of equipment.\n\n**IMPERIAL OFFICER**\nYou'll never leave this place alive, bounty hunter! This technology will remake the galaxy!\n\nMando emerges, blaster rifle raised. A quick burst, striking the Officer's blaster arm. He screams, dropping the weapon. Mando quickly disarms him, then shoves him against a wall.\n\n**MANDO**\nWhere are the rest?\n\n**IMPERIAL OFFICER**\n(Panting, defiance in his eyes)\nYou think this is all?! You're surrounded! Our patrol ships...\n\nA sudden, sharp WHISTLING from Mando's wrist. The OFFICER'S eyes widen in panic as three whistling birds launch and embed themselves into his chest, detonating. The Officer falls, lifeless.\n\nMando turns to Dr. Vane, who is trembling, staring at the bio-reactor.\n\n**MANDO**\nDr. Vane. We need to go.\n\n**DR. VANE**\n(Tears in her eyes)\nThe reactor... they're almost done stabilizing the accelerant. If it goes active... it could contaminate the entire system. It's designed to rapidly terraform, but without proper controls... it would just... consume.\n\nMando looks at the monstrous machine.\n\n**MANDO**\nCan you disable it? Permanently?\n\n**DR. VANE**\nIt would take precise coding, an access key... and time. Time we don't have. Unless... I could overload the containment field. But that would cause a massive power surge.\n\n**MANDO**\nDo it. Now.\n\nShe scrambles back to her console, fingers flying across the controls. The green glow intensifies. The humming becomes a high-pitched whine.\n\n**DR. VANE**\n(Frantic)\nThey're going to detect this surge! We need to move!\n\nThe chamber begins to SHAKE. Warning alarms blare, echoing through the facility.\n\n**MANDO**\n(Grabbing her arm)\nLet's go.\n\n---\n\n**EXT. KRYLLON PRIME - MINING FACILITY - DAY**\n\nMando, with Dr. Vane hurrying beside him, sprints through the dust-choked corridors. The facility groans, pipes burst, and distant explosions reverberate.\n\nSuddenly, two STORMTROOPERS round a corner, blasters raised.\n\n**STORMTROOPER 1**\nThere!\n\nMando pushes Dr. Vane behind a derelict mining cart, then unleashes a volley of blaster fire. One Stormtrooper goes down. The other returns fire, hitting the cart, sending sparks flying.\n\nA tiny, familiar *gurgle* from the direction of Mando's ship.\n\nGrogu, who clearly didn't \"stay in the ship,\" has waddled his way through the dust and now stands perilously close, peering around a rock formation, his large eyes wide.\n\n**MANDO**\n(Through gritted teeth)\nGrogu! Get back!\n\nThe remaining Stormtrooper spots Grogu.\n\n**STORMTROOPER 2**\nLittle green thing! It's the Asset!\n\nHe redirects his blaster fire towards Grogu.\n\nMando snarls. He leaps out, blaster spitting fire, taking down the Stormtrooper.\n\nBut another group of Stormtroopers, led by a SQUAD LEADER, appears from a side tunnel. They're quickly gaining ground.\n\n**SQUAD LEADER**\nBox them in! Don't let them reach the ship!\n\nDr. Vane looks terrified. Mando puts himself between her, Grogu, and the advancing Imperials.\n\n**MANDO**\n(To Grogu)\nKid, can you help us out here?\n\nGrogu looks at the Stormtroopers, then at Mando, a determined look on his face. He raises a tiny hand, eyes squeezed shut in concentration.\n\nThe leading Stormtroopers suddenly stumble. Their blasters fly from their hands, clattering uselessly on the ground. One even trips over his own feet, falling face-first into the dust.\n\n**SQUAD LEADER**\nWhat in the...?! Force user! Open fire!\n\nMando seizes the moment, laying down covering fire, taking out the disarmed troopers. He scoops up Grogu with one arm, grabbing Dr. Vane's arm with the other.\n\n**MANDO**\nThis is the Way!\n\nThey run, the sounds of blaster fire and the groaning facility at their heels. The ground trembles violently.\n\n**DR. VANE**\nIt's going to blow!\n\nThey burst out of the facility, into the open air. The N-1 Starfighter is a short sprint away.\n\nAn Imperial SHUTTLE lifts off from a nearby landing pad, attempting to escape the impending explosion.\n\nMando fires his grappling hook, latching onto the N-1's open boarding ramp. He pulls himself and Dr. Vane up, Grogu safely tucked against his chest.\n\nThey are barely inside when the N-1's engines roar to life.\n\n---\n\n**INT. N-1 STARFIGHTER - COCKPIT**\n\nMando is already launching, ascending rapidly.\n\n**MANDO**\nStrap in!\n\nHe pulls a series of maneuvers, dodging debris now raining down from the exploding facility.\n\n**EXT. KRYLLON PRIME - ATMOSPHERE**\n\nBelow, the mining colony erupts in a blinding, green-tinged explosion that rapidly consumes the entire facility, sending a shockwave rippling across the planet's surface. A cloud of sickly green dust billows into the upper atmosphere.\n\nThe Imperial Shuttle, caught in the blast, tumbles and explodes.\n\nThe N-1 breaks free of the atmosphere, ascending towards space.\n\n---\n\n**INT. N-1 STARFIGHTER - HYPERSPACE**\n\nPeace at last. Grogu is in his bubble, tired but content. Dr. Vane, still a bit shaken, is looking at Mando with awe and gratitude.\n\n**DR. VANE**\nYou... you saved me. And the galaxy, from what they were trying to unleash. Thank you.\n\n**MANDO**\n(Checking his blaster)\nJust doing the job.\n\n**DR. VANE**\nI heard whispers... Greef Karga mentioned the New Republic might be interested. Will they... will they trust me? After my past service?\n\n**MANDO**\nYou disabled the reactor. You helped. That's what matters.\n\nHe points to a blinking light on his console.\n\n**MANDO**\nLooks like Greef got a message to them. They're waiting.\n\n---\n\n**INT. NEW REPUBLIC COMMAND SHIP - HANGAR BAY**\n\nThe N-1 Starfighter lands smoothly in a pristine hangar.\n\nGreef Karga, looking unusually formal, stands next to CAPTAIN CARSON TEVA, who has a small squad of New Republic security behind him.\n\nMando and Dr. Vane descend the ramp. Grogu peeks out from Mando's satchel, his ears twitching.\n\n**GREEF KARGA**\nMandalorian, my friend! Another impeccable delivery. Dr. Vane, a pleasure to see you in... safer hands.\n\n**DR. VANE**\n(Nodding politely)\nThank you, Greef.\n\nCarson Teva steps forward, a serious but appreciative look on his face.\n\n**CARSON TEVA**\nMandalorian. Captain Teva. Your actions averted a potential catastrophe. We picked up the energy signature. Imperial remnant activity on that scale is concerning. Dr. Vane, your testimony will be invaluable.\n\n**DR. VANE**\nI'm ready to assist in any way I can, Captain. They forced me, but I never supported their aims.\n\n**CARSON TEVA**\nWe understand. And we're grateful. Mandalorian, once again, you've shown a dedication to justice that aligns perfectly with the New Republic's ideals. The offer still stands, should you ever choose a more... organized path.\n\nMando looks at Teva, then at Greef Karga, who subtly shrugs, a grin playing on his lips. Mando then looks down at Grogu, who gives a small, sleepy *yawn*.\n\n**MANDO**\n(To Teva)\nMy path is set.\n\nHe reaches into a pouch, pulling out a small datapad.\n\n**MANDO**\nThis is what she was working on. My guess is there are other labs, other facilities.\n\nTeva takes the datapad. His expression turns grim as he reads the data.\n\n**CARSON TEVA**\nThis... this is disturbing. Thank you, Mando. Your intelligence will save lives.\n\nMando gives a curt nod. Greef Karga steps forward, holding out a pouch of credits.\n\n**GREEF KARGA**\nYour payment, as promised. And a bonus for the... extra flair.\n\nMando takes the pouch, weighs it in his hand, then tucks it away.\n\nHe turns to the N-1. Grogu is already trying to climb back into his bubble.\n\n**CARSON TEVA**\nMandalorian, one day... I hope you realize what a powerful ally you could be.\n\nMando pauses at the ramp, looking back.\n\n**MANDO**\nI'm just a simple man trying to make his way in the universe.\n\nHe steps into the ship. The ramp slowly rises.\n\n**EXT. NEW REPUBLIC COMMAND SHIP - SPACE**\n\nThe N-1 Starfighter launches from the hangar bay, a streak of chrome against the vastness of space.\n\n**INT. N-1 STARFIGHTER - COCKPIT**\n\nMando sets a new course, engaging the hyperdrive. The stars stretch into lines, then blur into the familiar tunnel of hyperspace.\n\nGrogu, now wide awake, pulls a small, delicious-looking cookie from Mando’s supply stash (which Mando pretends not to notice). He takes a happy bite, crumbs scattering.\n\nMando looks at the streaking stars, then down at Grogu, a silent, comfortable understanding passing between them.\n\nThe galaxy is vast, dangerous, and full of echoes from the past. But for now, they are safe. And together.\n\n**FADE TO BLACK.**",
    "ig_handle": "zigzagjazzclub",
    "last_analyzed_at": "2025-12-13T05:32:48.215875+09:00",
    "confidence": 1.0,
    "extraction_version": "2.1.2",
    "prompt_name": "venue_profile_enrich",
    "prompt_version": "2.4.1",
    "sources": [
      "/Users/keunwoo/Codes/seoul.music/data/germany/jazz/ig_raw/venues/zigzagjazzclub/profile/2025-12-12/profile.json",
      "maps:https://maps.google.com/?cid=16259652994667978004",
      "gemini:enrich"
    ],
    "links": {
      "instagram": "https://www.instagram.com/zigzagjazzclub",
      "homepage": "https://www.zigzag-jazzclub.berlin/menu-marquee",
      "booking": null,
      "google_map": "https://maps.google.com/?cid=16259652994667978004"
    },
    "contacts": {
      "phone": "030-94049147",
      "email": null
    },
    "websites": [
      "https://www.zigzag-jazzclub.berlin/menu-marquee"
    ],
    "genres": [
      "Jazz Club"
    ],
    "locations": [
      {
        "location_id": "main",
        "name": "Zig Zag Jazz Club",
        "address_text": "Hauptstraße 89, 12159 Berlin, Germany",
        "address_components": null,
        "location_lat": null,
        "location_lon": null,
        "subway_nearby": null,
        "booking_link": null,
        "notes": "Blues, soul & jazz performances staged in a classy, laid-back lounge serving cocktails & bar bites.",
        "i18n": {
          "name": {
            "en": "Zig Zag Jazz Club"
          },
          "address_text": {
            "en": "Hauptstraße 89, 12159 Berlin, Germany"
          },
          "notes": {
            "en": "Blues, soul & jazz performances staged in a classy, laid-back lounge serving cocktails & bar bites."
          }
        }
      }
    ],
    "i18n": {
      "name": {
        "en": "Zig Zag Jazz Club"
      },
      "address_text": null,
      "notes": {
        "en": "Blues, soul & jazz performances staged in a classy, laid-back lounge serving cocktails & bar bites."
      },
      "genres": {
        "en": [
          "Jazz Club"
        ]
      },
      "subway_nearby": null,
      "food_policy": null,
      "age_limit": null
    }
  }
]